CSI API ETABS v1
cDesignConcrete Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cDesignConcrete
Public Interface cDesignConcrete
Dim instance As cDesignConcrete
public interface class cDesignConcrete
type cDesignConcrete =  interface end
The cDesignConcrete type exposes the following members.
Properties
Name | Description
ACI318_08_IBC2009
ACI318_14
ACI318_19
AS_3600_09
AS_3600_2018
BS8110_97
Chinese_2010
Eurocode_2_2004
Indian_IS_456_2000
Mexican_RCDF_2017
SP63_13330_2012
TS_500_2000_R2018
Top
Methods
Name | Description
GetCode
 Retrieves the concrete design code.
GetDesignSection
 Retrieves the design section for a specified concrete frame object
GetRebarPrefsBeam
 Retrieves data from the Rebar Selection Rules for Beams
GetRebarPrefsColumn
 Retrieves data from the Rebar Selection Rules for Columns
GetResultsAvailable
 This function determines if the concrete frame design results are available.
GetSeismicFramingType
GetSummaryResultsBeam
 Retrieves beam summary results for concrete design.
GetSummaryResultsBeam_2
GetSummaryResultsColumn
 Retrieves column summary results for concrete design
GetSummaryResultsJoint
SetCode
 Sets the concrete design code.
SetComboStrength
SetDesignSection
 Modifies the design section for all specified frame objects that have a concrete frame design procedure
StartDesign
 Starts the concrete frame design.
Top
See Also
Reference
ETABSv1 Namespace